In [64]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats as stat

In [65]:
barley_pd = pd.read_csv('CerealData/barley-production.csv')
maize_pd = pd.read_csv('CerealData/maize-production.csv')
rice_pd = pd.read_csv('CerealData/rice-production.csv')
rye_pd = pd.read_csv('CerealData/rye-production.csv')
wheat_pd = pd.read_csv('CerealData/wheat-production.csv')

In [66]:
barley_pd.head()

        Entity Code  Year  Barley | 00000044 || Production | 005510 || tonnes
0  Afghanistan  AFG  1961                                             378000
1  Afghanistan  AFG  1962                                             378000
2  Afghanistan  AFG  1963                                             378000
3  Afghanistan  AFG  1964                                             380000
4  Afghanistan  AFG  1965                                             380000

In [67]:
maize_pd.head()

        Entity Code  Year  Maize | 00000056 || Production | 005510 || tonnes
0  Afghanistan  AFG  1961                                             700000
1  Afghanistan  AFG  1962                                             700000
2  Afghanistan  AFG  1963                                             713000
3  Afghanistan  AFG  1964                                             720000
4  Afghanistan  AFG  1965                                             720000

In [68]:
barley_pd = barley_pd.drop('Code', axis=1)
maize_pd = maize_pd.drop('Code', axis=1)
rice_pd = rice_pd.drop('Code', axis=1)
rye_pd = rye_pd.drop('Code', axis=1)
wheat_pd = wheat_pd.drop('Code', axis=1)

In [69]:
barley_pd.head()

        Entity  Year  Barley | 00000044 || Production | 005510 || tonnes
0  Afghanistan  1961                                             378000
1  Afghanistan  1962                                             378000
2  Afghanistan  1963                                             378000
3  Afghanistan  1964                                             380000
4  Afghanistan  1965                                             380000

In [70]:
barley_pd.columns = ['Country', 'Year', 'BarleyTonnes']
maize_pd.columns = ['Country', 'Year', 'MaizeTonnes']
rice_pd.columns = ['Country', 'Year', 'RiceTonnes']
rye_pd.columns = ['Country', 'Year', 'RyeTonnes']
wheat_pd.columns = ['Country', 'Year', 'WheatTonnes']

In [71]:
barley_pd.head()

       Country  Year  BarleyTonnes
0  Afghanistan  1961        378000
1  Afghanistan  1962        378000
2  Afghanistan  1963        378000
3  Afghanistan  1964        380000
4  Afghanistan  1965        380000

In [72]:
barley_pd['Barley_PChange'] = barley_pd['BarleyTonnes'].pct_change()
maize_pd['Maize_PChange'] = maize_pd['MaizeTonnes'].pct_change()
rice_pd['Rice_PChange'] = rice_pd['RiceTonnes'].pct_change()
rye_pd['Rye_PChange'] = rye_pd['RyeTonnes'].pct_change()
wheat_pd['Wheat_PChange'] = wheat_pd['WheatTonnes'].pct_change()

In [41]:
maize_pd.head()

       Country  Year  Tonnes   PChange
0  Afghanistan  1961  700000       NaN
1  Afghanistan  1962  700000  0.000000
2  Afghanistan  1963  713000  0.018571
3  Afghanistan  1964  720000  0.009818
4  Afghanistan  1965  720000  0.000000

In [44]:
barley_pd = barley_pd.dropna()
maize_pd = maize_pd.dropna()
rice_pd = rice_pd.dropna()
rye_pd = rye_pd.dropna()
wheat_pd = wheat_pd.dropna()

In [45]:
barley_pd.head()

       Country  Year  Tonnes   PChange
1  Afghanistan  1962  378000  0.000000
2  Afghanistan  1963  378000  0.000000
3  Afghanistan  1964  380000  0.005291
4  Afghanistan  1965  380000  0.000000
5  Afghanistan  1966  375000 -0.013158

In [54]:
c1 = pd.merge(barley_pd, maize_pd, on=['Year','Country'])
c2 = pd.merge(rice_pd, rye_pd, on=['Year','Country'])
c3 = pd.merge(c1, c2, on=['Year','Country'])
Cereal = pd.merge(c3, wheat_pd, on=['Year','Country'])

In [52]:
Cereal

       Country  Year  Tonnes_x  PChange_x  Tonnes_y  PChange_y
0  Afghanistan  1962    378000   0.000000    700000   0.000000
1  Afghanistan  1963    378000   0.000000    713000   0.018571
2  Afghanistan  1964    380000   0.005291    720000   0.009818
3  Afghanistan  1965    380000   0.000000    720000   0.000000
4  Afghanistan  1966    375000  -0.013158    720000   0.000000